Autodesk.Revit.DB.FabricationConfiguration.IsDirty
Returns:
True if the fabrication browser is dirty.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.MarkDirty(System.Boolean)
Set the flag indicating if the fabrication browser is dirty.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetConnectedUpdateIndex
Returns the baseline index of the last applied update. The configuration must be a connected remote configuration for this call to succeed.
Returns:
Returns the index of the current updates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration is not remote or is not connected.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.IsConnected
Get whether this config is a remote configuration that is connected.
Returns:
Returns true if the configuration is remote and connected.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.UnloadServicesAndItemFiles(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.String})
Unload the specific fabrication service from project.
serviceIds:
The ids of the fabrication services to unload.
itemFiles:
The relative filenames of the fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are in use currently.
-or-
Some item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadItemFilesInternal(System.Collections.Generic.IList{System.String})
Unload the specified fabrication item files from the project.
itemFiles:
The fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are in use currently.
-or-
Some item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.AreItemFilesLoadedInternal(System.Collections.Generic.IList{System.String})
Checks if the item files have been loaded.
itemFilePaths:
The paths of the item files.
Returns:
Returns true if the item files have been loaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.CanUnloadItemFilesInternal(System.Collections.Generic.IList{System.String})
Checks if the fabrication item files are already in use and should not be unloaded.
itemFiles:
The fabrication item files to unload.
Returns:
Returns true if the fabrication item files can be unloaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadItemFilesInternal(System.Collections.Generic.IList{System.String})
Loads the specified fabrication item files into the project.
itemFiles:
The relative paths of the fabrication item files to load.
Returns:
The relative paths of the fabrication item files which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedItemFilesInternal
Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.
Returns:
All the relative filenames of the used fabrication item files.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedItemFiles
Get list of all loaded fabrication item files.
Returns:
Returns the loaded fabrication item files.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration is not set yet.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetItemFolders
Gets a list of every fabrication item folder in  the fabrication item folder structure.
Returns:
Returns a list of every fabrication item folder in the fabrication item folder structure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetServiceTypeName(System.Int32)
Gets the service type name.
serviceTypeId:
The service type identifier.
Since:
2018

Autodesk.Revit.DB.FabricationConfiguration.IsAncillaryKit(System.Int32)
Gets whether the specified fabrication ancillary identifier is an ancillary kit or not.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
Returns true if the ancillary is a kit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ancillary does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryGroupName(System.Int32)
Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The group and name of the ancillary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ancillary does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryGroup(System.Int32)
Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The group name of the ancillary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ancillary does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryName(System.Int32)
Gets the fabrication ancillary name for the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The name of the ancillary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ancillary does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaries(Autodesk.Revit.DB.Fabrication.FabricationAncillaryType,System.Boolean,System.Boolean)
Gets fabrication ancillaries of the specified type.
type:
The type of ancillaries to get.
includeKits:
Whether or not to include ancillary kits as well.
filterKits:
Whether kits should be filtered to only those that contain the specified ancillary type.
Returns:
An array of ancillary identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.AncillaryExists(System.Int32)
Checks to see if the specified ancillary exists.
ancillaryId:
The ancillary identifier.
Returns:
Returns true if the ancillary exists.
Since:
2018

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorDomain(System.Int32)
Gets the fabrication connector domain from its identifier.
fabricationConnectorId:
The fabrication connector identifier.
Returns:
The fabrication connector's domain.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorShape(System.Int32)
Gets the fabrication connector shape from its identifier.
fabricationConnectorId:
The fabrication connector identifier.
Returns:
The fabrication connector's shape.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorGroup(System.Int32)
Gets the fabrication connector group from its identifier.
fabricationConnectorId:
The fabrication connector identifier.
Returns:
The fabrication connector's group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorName(System.Int32)
Gets the fabrication connector name from its identifier.
fabricationConnectorId:
The fabrication connector identifier.
Returns:
The fabrication connector's name.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LocateFabricationConnector(System.String,System.String,Autodesk.Revit.DB.ConnectorDomainType,Autodesk.Revit.DB.ConnectorProfileType)
Gets the fabrication connector identifiers by group and name, filtered by shape and domain.
group:
The fabrication connector group.
name:
The fabrication connector name.
domain:
ConnectorDomainType to filter by. Pass ConnectorDomainType::Undefined to get all connector domains.
shape:
ConnectorProfileType to filter by. Pass ConnectorProfileType::Invalid to get all shapes.
Returns:
Return the fabrication connector identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllFabricationConnectorDefinitions(Autodesk.Revit.DB.ConnectorDomainType,Autodesk.Revit.DB.ConnectorProfileType)
Gets fabrication connector identifiers from the fabrication configuration, filtered by shape and domain.
domain:
ConnectorDomainType to filter by. Pass ConnectorDomainType.Undefined to get all connector domains.
shape:
ConnectorProfileType to filter by. Pass ConnectorProfileType.Invalid to get all shapes.
Returns:
All the fabrication connector identifiers, filtered by shape and domain. The return will be empty if no connectors are found.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationAbbreviation(System.Int32)
Gets insulation specification abbreviation.
insulationSpecificationId:
The insulation specification identifier.
Since:
2017

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationAbbreviation(System.Int32)
Gets specification abreviation.
specificationId:
The specification identifier.
Since:
2017

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialAbbreviation(System.Int32)
Gets the abreviation of the material or the insulation or the double wall material.
materialId:
The material identifier.
Since:
2017

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialName(System.Int32)
Gets material name from its identifier.
materialId:
The material identifier.
Returns:
The material name without the group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialThickness(System.Int32,System.Int32)
Gets material thickness from its material/gauge identifiers.
materialId:
The material identifier.
gaugeId:
The gauge identifier within the specified material.
Returns:
The thickness of the material/gauge.
Since:
2017

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGroup(System.Int32)
Gets material group from its identifier.
materialId:
The material identifier.
Returns:
The material group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LocateMaterial(System.String,System.String)
Gets material by group and name.
group:
The material group.
name:
The group name.
Returns:
The material identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllMaterials(Autodesk.Revit.DB.FabricationPart)
Gets all material identifiers in the fabrication configuration.
Remarks:
If a part is passed, only returns materials which are valid for the part, otherwise returns all materials.
part:
The fabrication part.
Returns:
An array of material identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationGroup(System.Int32)
Gets the insulation specification group from its identifier.
specId:
The insulation specification identifier.
Returns:
The insulation specification group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationName(System.Int32)
Gets the insulation specification name from its identifier.
specId:
The insulation specification identifier.
Returns:
The insulation specification name.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LocateInsulationSpecification(System.String,System.String)
Gets the insulation specification by group and name.
group:
The insulation specification group.
name:
The insulation specification name.
Returns:
The insulation specification identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllInsulationSpecifications(Autodesk.Revit.DB.FabricationPart)
Gets all insulation specification identifiers in the fabrication configuration.
Remarks:
If a part is passed, only returns insulation specification which are valid for the part, otherwise returns all insulation specifications.
pFabPart:
The fabrication part.
Returns:
An array of insulation specification identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetPartCustomDataType(System.Int32)
Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
customDataId:
The custom data identifier.
Returns:
The custom data type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetPartCustomDataName(System.Int32)
Gets the custom data name from its identifier.
customDataId:
The custom data identifier.
Returns:
The custom data name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAllPartCustomData
Gets all possible fabrication part custom data identifiers.
Returns:
an array of custom data identifiers.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.CustomDataExists(System.Int32)
Checks to see if the specified custom data exists.
customDataId:
The custom data identifier.
Returns:
Returns true if the custom data exists.
Since:
2018

Autodesk.Revit.DB.FabricationConfiguration.GetPartStatusDescription(System.Int32)
Gets the status description from its identifier.
statusId:
The status identifier.
Returns:
The status description.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAllPartStatuses
Gets all possible fabrication part status identifiers.
Returns:
an array of status identifiers.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.DamperExists(System.Int32)
Checks to see if the specified damper exists.
damperId:
The damper identifier to check.
Returns:
Returns true if the damper exists.
Since:
2018

Autodesk.Revit.DB.FabricationConfiguration.GetDamperName(System.Int32)
Gets the damper name from its identifier.
damperId:
The damper identifier.
Returns:
The damper name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The damper does not exist.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAllDampers
Gets all damper identifiers in the fabrication configuration.
Returns:
An array of specification identifiers.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGroup(System.Int32)
Gets the specification group from its identifier.
specId:
The specification identifier.
Returns:
The specification group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationName(System.Int32)
Gets the specification name from its identifier.
specId:
The specification identifier.
Returns:
The specification name;
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LocateSpecification(System.String,System.String)
Gets the specification identifier by group and name.
group:
The specification group.
name:
The specification name.
Returns:
The specification identifier. Returns -1 if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllSpecifications(Autodesk.Revit.DB.FabricationPart)
Gets all specification identifiers in the fabrication configuration.
Remarks:
If a part is passed, only returns specifications which are valid for the part, otherwise returns all specifications.
part:
The fabrication part.
Returns:
An array of specification identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetService(System.Int32)
Get the service based on the service identifier from the fabrication configuration in the current document.
serviceId:
The service identifier.
Returns:
The service based on the service identifier.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Unload the specified fabrication item files from the project.
itemFiles:
The fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are currently in use.
-or-
Some fabrication item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.UnloadServices(System.Collections.Generic.IList{System.Int32})
Unload the specified fabrication services from the project.
serviceIds:
The ids of the fabrication services to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication services can not be unloaded if they are in use currently.
-or-
Some services are not loaded yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.AreItemFilesLoaded(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Checks if the fabrication item files have been loaded.
itemFiles:
The fabrication item files.
Returns:
Returns true if the fabrication item files have been loaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.CanUnloadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Checks if the fabrication item files are already in use and should not be unloaded.
itemFiles:
The fabrication item files to unload.
Returns:
Returns true if the fabrication item files can be unloaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadItemFiles(System.Collections.Generic.IList{Autodesk.Revit.DB.FabricationItemFile})
Loads the specified fabrication item files into the project.
itemFiles:
The relative paths of the fabrication item files to load.
Returns:
The relative paths of the fabrication item files which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.LoadServices(System.Collections.Generic.IList{System.Int32})
Loads the specified fabrication services into the project.
serviceIds:
The ids of the fabrication services to load.
Returns:
The ids of the fabrication services which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedItemFiles
Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.
Returns:
All the used fabrication item files.
Since:
2019

Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedServices
Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.
Returns:
All the used fabrication services.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedServices
Returns all the loaded fabrication services.
Returns:
All the loaded fabrication services.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetAllServices
Returns all fabrication services in the fabrication configuration.
Returns:
All fabrication services. The return will be empty if no services are found.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetProfile
Return the profile of the loaded fabrication configuration. Return empty string for global profile.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo,System.String)
Set the fabrication configuration with specific profile.
fabricationConfigurationInfo:
The desired fabrication configuration.
profile:
The desired profile of the fabrication configuration. Use empty string for the global profile.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The profile "profile" is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document.
-or-
Cannot set the configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo)
Set the fabrication configuration with global profile.
fabricationConfigurationInfo:
The desired fabrication configuration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document.
-or-
Cannot set the configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.ReloadConfiguration
Reloads the fabrication configuration from its source fabrication configuration.
Remarks:
The configuration must be reloaded from its source fabrication configuration before loading new fabrication services or additional parts.
Returns:
The information about the reload of the fabrication configuration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration is not set yet.
-or-
The source fabrication configuration could not be found.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.CanBeSwapped
Checks if the fabrication configuration can be swapped.
Remarks:
Swapping configuration is not permitted if the existing configuration has already been used to create fabrication part elements in the document.
Returns:
True if the fabrication configuration can be swapped, false otherwise.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfigurationInfo
Gets the information about the fabrication configuration of the project.
Returns:
The information about the fabrication configuration of the project.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.HasValidConfiguration
Checks whether a valid fabrication configuration has been set for the project.
Returns:
True if a valid fabrication configuration has been set for the project.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfiguration(Autodesk.Revit.DB.Document)
Gets the fabrication configuration element in the document.
doc:
The document.
Returns:
The fabrication configuration element in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration
This element contains the information about the fabrication configuration settings used by the project.
Remarks:
The element provides information about the location of the fabrication database, its properties, and settings related to fabrication items.
Since:
2016